In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as pt

In [2]:
df=pd.read_csv('salaries.csv')

In [3]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
from sklearn import preprocessing
com=preprocessing.LabelEncoder()
job=preprocessing.LabelEncoder()
degree=preprocessing.LabelEncoder()

In [5]:
df['company']=com.fit_transform(df['company'])

In [6]:
df.head()

   company                  job     degree  salary_more_then_100k
0        2      sales executive  bachelors                      0
1        2      sales executive    masters                      0
2        2     business manager  bachelors                      1
3        2     business manager    masters                      1
4        2  computer programmer  bachelors                      0

In [7]:
df['job']=job.fit_transform(df['job'])

In [8]:
df['degree']=degree.fit_transform(df['degree'])

In [9]:
df

    company  job  degree  salary_more_then_100k
0         2    2       0                      0
1         2    2       1                      0
2         2    0       0                      1
3         2    0       1                      1
4         2    1       0                      0
5         2    1       1                      1
6         0    2       1                      0
7         0    1       0                      0
8         0    0       0                      0
9         0    0       1                      1
10        1    2       0                      1
11        1    2       1                      1
12        1    0       0                      1
13        1    0       1                      1
14        1    1       0                      1
15        1    1       1                      1

In [10]:
x=df.drop(['salary_more_then_100k'], axis=1)

In [11]:
x

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [12]:
y=df['salary_more_then_100k']

In [13]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [14]:
from sklearn import linear_model
model=linear_model.LogisticRegression()
model.fit(x,y)
model.score(x,y)

0.75

In [15]:
from sklearn import model_selection
train_x,test_x,train_y,test_y=model_selection.train_test_split(x,y)

In [16]:
train_x

    company  job  degree
12        1    0       0
6         0    2       1
1         2    2       1
10        1    2       0
11        1    2       1
9         0    0       1
3         2    0       1
7         0    1       0
14        1    1       0
8         0    0       0
0         2    2       0
13        1    0       1

In [17]:
test_x

    company  job  degree
15        1    1       1
4         2    1       0
2         2    0       0
5         2    1       1

In [18]:
train_y

12    1
6     0
1     0
10    1
11    1
9     1
3     1
7     0
14    1
8     0
0     0
13    1
Name: salary_more_then_100k, dtype: int64

In [19]:
test_y

15    1
4     0
2     1
5     1
Name: salary_more_then_100k, dtype: int64

In [20]:
from sklearn import linear_model
model=linear_model.LogisticRegression()

In [21]:
model.fit(train_x,train_y)

LogisticRegression()

In [22]:
len(train_x)

12

In [23]:
len(train_y)

12

In [24]:
model.score(test_x,test_y)

0.75

In [25]:
model.predict(test_x)

array([1, 1, 1, 1], dtype=int64)

In [26]:
test_y

15    1
4     0
2     1
5     1
Name: salary_more_then_100k, dtype: int64

In [27]:
model.predict(train_x)

array([1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1], dtype=int64)

In [28]:
train_y

12    1
6     0
1     0
10    1
11    1
9     1
3     1
7     0
14    1
8     0
0     0
13    1
Name: salary_more_then_100k, dtype: int64

In [29]:
train_x.to_csv('salaryprediction_train_x.csv')

In [30]:
train_y.to_csv('salaryprediction_train_y.csv')
test_x.to_csv('salaryprediction_test_x.csv')
test_y.to_csv('salaryprediction_test_y.csv')